Updating the README file
